# Pandas Library Overview

## Description

This Jupyter Notebook is a comprehensive guide to the most commonly used features of the Pandas library. It includes detailed explanations and practical examples of various functions and methods used for data manipulation, analysis, and visualization. This notebook serves as a useful reference for anyone looking to understand and utilize the powerful capabilities of Pandas for data science and analytics.

## Table of Contents
``` markdown
1. [Introduction and Data Structures](#Introduction-and-Data-Structures)
    1.1. Overview of Pandas Library
    1.2. Installation
    1.3. Series
        1.3.1. Creation
        1.3.2. Attributes and Methods
    1.4. DataFrame
        1.4.1. Creation
        1.4.2. Attributes and Methods

2. [Data Input, Output, and Exploration](#Data-Input-Output-and-Exploration)
    2.1. Reading and Writing CSV Files
    2.2. Reading and Writing Excel Files
    2.3. Reading and Writing JSON Files
    2.4. Connecting to and Querying SQL Databases
    2.5. Previewing DataFrames (head, tail)
    2.6. Summary Information (info, describe)
    2.7. Checking and Converting Data Types (dtypes, astype)
    2.8. Handling Missing Values (isnull, dropna, fillna)

3. [Data Selection, Filtering, and Transformation](#Data-Selection-Filtering-and-Transformation)
    3.1. Selecting Columns ([], loc, iloc)
    3.2. Conditional Filtering
    3.3. Using Queries (query)
    3.4. Sampling Data (sample)
    3.5. Sorting Data (sort_values, sort_index)
    3.6. Merging DataFrames (merge, join)
    3.7. Concatenating DataFrames (concat, append)
    3.8. Grouping and Aggregating Data (groupby, agg)
    3.9. Pivot Tables (pivot_table)
    3.10. Removing Duplicates (duplicated, drop_duplicates)

4. [Data Conversion, Computation, and Visualization](#Data-Conversion-Computation-and-Visualization)
    4.1. Converting Data Types (astype)
    4.2. Applying Functions (apply, map, applymap)
    4.3. String Manipulation (str accessor)
    4.4. Handling Date and Time Data (pd.to_datetime, dt accessor)
    4.5. Basic Visualization (plot, hist, box, scatter)
    4.6. Visualization with Seaborn

5. [Advanced Topics and Practical Examples](#Advanced-Topics-and-Practical-Examples)
    5.1. MultiIndex DataFrames
    5.2. Reshaping DataFrames (melt, stack, unstack)
    5.3. Applying Custom Functions (applymap, transform)
    5.4. EDA Project Example
    5.5. Machine Learning Data Preprocessing Example
    5.6. Time Series Data Analysis Example
```

In [17]:
import pandas as pd

## 1. Introduction and Data Structures

### 1.1. Overview of Pandas Library
Pandas is a powerful and flexible open-source data analysis and manipulation library for Python. It provides data structures like Series and DataFrame, which are designed to make data manipulation and analysis fast and easy. Pandas is built on top of NumPy and is often used in conjunction with other libraries such as Matplotlib and Scikit-learn.

### 1.2. Installation
To install Pandas, you can use pip (Python's package installer) by running the following command in your terminal or command prompt:
`!pip install pandas`

### 1.3 Series
#### 1.3.1 Creation
A Pandas Series is a one-dimensional array-like object that can hold various data types such as integers, floats, and strings. It is similar to a column in a table or a spreadsheet.

In [ ]:
# Creating a Series from a list
data = [1, 2, 3, 4, 5]
series = pd.Series(data)
series

In [25]:
# Creating a Series with custom index
data = [1, 2, None, 4, 'c']
index = ['a', 'b', 'c', 'd', 'e']
series = pd.Series(data, index=index)
series

a       1
b       2
c    None
d       4
e       c
dtype: object

#### 1.3.2 Attributes and Methods
Pandas Series comes with a variety of attributes and methods that make data manipulation straightforward. Here are some of the commonly used attributes and methods:

| **Method/Attribute** | **Description**                                      | **Example Code**                                             |
|----------------------|------------------------------------------------------|--------------------------------------------------------------|
| `series.sum()`       | Calculates the sum of the Series.                    | `series.sum()`                                               |
| `series.mean()`      | Calculates the mean of the Series.                   | `series.mean()`                                              |
| `series.max()`       | Finds the maximum value in the Series.               | `series.max()`                                               |
| `series.isnull()`    | Checks for null values in the Series, returns a Boolean Series. | `series_with_nan.isnull()`                                   |
| `series.notnull()`   | Checks for non-null values in the Series, returns a Boolean Series. | `series_with_nan.notnull()`                                  |
| `series.fillna()`    | Fills null values with the specified value.          | `series_with_nan.fillna(0)`                                  |
| `series.apply()`     | Applies a function to each element of the Series.    | `series.apply(lambda x: x ** 2)`                             |
| `series.count()`     | Counts the non-null elements in the Series.          | `series.count()`                                             |
| `series.std()`       | Calculates the standard deviation of the Series.     | `series.std()`                                               |
| `series.median()`    | Calculates the median of the Series.                 | `series.median()`                                            |
| `series.quantile()`  | Calculates the specified quantile of the Series.     | `series.quantile(0.25)`                                      |
| `series.value_counts()` | Counts the occurrences of each value in the Series.  | `series.value_counts()`                                      |
| `series.sort_values()` | Sorts the Series by its values.                      | `series.sort_values()`                                       |
| `series.rank()`         | Ranks the values in the Series.                     | `series.rank()`                                              |
| `series.cumsum()`       | Calculates the cumulative sum of the Series.        | `series.cumsum()`                                            |
| `series.shift()`        | Shifts the values in the Series by the specified number of periods. | `series.shift(1)`                                            |
| `np.log(series)`        | Applies the NumPy log function to the Series.       | `np.log(series)`                                             |
| `series.reindex()`      | Reindexes the Series with the specified index, filling missing values with the specified value. | `series.reindex(['a', 'b', 'c', 'd', 'e', 'f'], fill_value=0)` |

In [31]:
# Checking for missing values
series.isnull()

a    False
b    False
c     True
d    False
e    False
dtype: bool

In [32]:
# Checking for non-missing values
series.notnull()

a     True
b     True
c    False
d     True
e     True
dtype: bool

In [33]:
# Filling missing values
series.fillna(9999)

a       1
b       2
c    9999
d       4
e       c
dtype: object

In [ ]:
# Creating a Series with custom index
data = [10, 2, 7, 4, 1]
index = ['a', 'b', 'c', 'd', 'e']
series = pd.Series(data, index=index)

In [ ]:
# Ranking
series.rank()

a    5.0
b    2.0
c    4.0
d    3.0
e    1.0
dtype: float64

In [41]:
# Sorting
series.sort_values()

e     1
b     2
d     4
c     7
a    10
dtype: int64

In [42]:
# Cumulative sum
series.cumsum()

a    10
b    12
c    19
d    23
e    24
dtype: int64

In [38]:
# Shifting values
series.shift(1)

a     NaN
b    10.0
c     2.0
d     7.0
e     4.0
dtype: float64

In [39]:
series.shift(-1)

a    2.0
b    7.0
c    4.0
d    1.0
e    NaN
dtype: float64

In [40]:
# Applying a function to each element
series.apply(lambda x: x ** 2)

a    100
b      4
c     49
d     16
e      1
dtype: int64

### 1.4. DataFrame

#### 1.4.1. Creation
A Pandas DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).
```python
import pandas as pd

# Creating a DataFrame from a dictionary
data = {
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': ['foo', 'bar', 'baz', 'qux', 'quux']
}
df = pd.DataFrame(data)
print("DataFrame from dictionary:\n", df)

# Creating a DataFrame from a list of dictionaries
data = [
    {'A': 1, 'B': 10, 'C': 'foo'},
    {'A': 2, 'B': 20, 'C': 'bar'},
    {'A': 3, 'B': 30, 'C': 'baz'}
]
df = pd.DataFrame(data)
print("DataFrame from list of dictionaries:\n", df)

# Creating a DataFrame from a list of lists
data = [
    [1, 10, 'foo'],
    [2, 20, 'bar'],
    [3, 30, 'baz']
]
columns = ['A', 'B', 'C']
df = pd.DataFrame(data, columns=columns)
print("DataFrame from list of lists:\n", df)

#### 1.4.2. Attributes and Methods
Pandas DataFrame comes with a variety of attributes and methods that make data manipulation straightforward. Here are some of the commonly used attributes and methods:

| **Attribute/Method** | **Description**                                         | **Example Code**                                                |
|----------------------|---------------------------------------------------------|-----------------------------------------------------------------|
| `df.shape`           | Returns a tuple representing the dimensionality of the DataFrame. | `df.shape`                                                     |
| `df.columns`         | Returns the column labels of the DataFrame.             | `df.columns`                                                   |
| `df.index`           | Returns the row labels of the DataFrame.                | `df.index`                                                     |
| `df.dtypes`          | Returns the data types of each column in the DataFrame. | `df.dtypes`                                                    |
| `df.head()`          | Returns the first n rows of the DataFrame (default is 5). | `df.head()`                                                    |
| `df.tail()`          | Returns the last n rows of the DataFrame (default is 5). | `df.tail()`                                                    |
| `df.describe()`      | Generates descriptive statistics of numeric columns.    | `df.describe()`                                                |
| `df.sum()`           | Returns the sum of the values for each column.          | `df.sum()`                                                     |
| `df.mean()`          | Returns the mean of the values for each column.         | `df.mean()`                                                    |
| `df.max()`           | Returns the maximum value of each column.               | `df.max()`                                                     |
| `df['column_name']`  | Selects a column.                                        | `df['A']`                                                      |
| `df[['col1', 'col2']]` | Selects multiple columns.                               | `df[['A', 'B']]`                                               |
| `df[start:stop]`     | Selects rows by slicing (start is inclusive, stop is exclusive). | `df[0:3]`                                                      |
| `df.loc[]`           | Accesses a group of rows and columns by labels or a boolean array. | `df.loc[2:4, 'A']`                                             |
| `df.iloc[]`          | Accesses a group of rows and columns by integer position. | `df.iloc[2:5, 0]`                                              |
| `df[df['col'] > value]` | Selects rows where the column value meets a condition.    | `df[df['A'] > 2]`                                              |
| `df.drop()`          | Drops specified labels from rows or columns.            | `df.drop('D', axis=1)`                                         |
| `df.sort_values()`   | Sorts the DataFrame by the values of one or more columns. | `df.sort_values(by='B', ascending=False)`                      |
| `df.fillna()`        | Fills missing values with a specified value.            | `df.fillna(0)`                                                 |
| `df.apply()`         | Applies a function along an axis of the DataFrame.      | `df['A'].apply(lambda x: x ** 2)`                              |
| `df.cumsum()`        | Returns the cumulative sum over a DataFrame or Series.  | `df.cumsum()`                                                  |
| `df.reindex()`       | Conforms the DataFrame to a new index with optional filling logic. | `df.reindex(['a', 'b', 'c', 'd', 'e', 'f'], fill_value=0)`     |
| `df.value_counts()`  | Returns a Series containing counts of unique values.    | `df['A'].value_counts()`                                       |
| `df.std()`           | Returns the standard deviation of the values for each column. | `df.std()`                                                     |
| `df.median()`        | Returns the median of the values for each column.       | `df.median()`                                                  |
| `df.quantile()`      | Returns values at the given quantile over requested axis. | `df.quantile(0.25)`                                            |
| `df.rank()`          | Computes numerical data ranks (1 through n) along axis. | `df.rank()`                                                    |
| `df.shift()`         | Shifts the values in the DataFrame by the desired number of periods. | `df.shift(1)`                                                  |
| `np.log(df)`         | Applies the NumPy log function to the DataFrame.        | `np.log(df)`                                                   |

In [50]:
# Sample DataFrame
data = {
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': ['foo', 'bar', 'baz', 'qux', 'quux']
}
df = pd.DataFrame(data)
df

   A   B     C
0  1  10   foo
1  2  20   bar
2  3  30   baz
3  4  40   qux
4  5  50  quux

In [51]:
# Accessing DataFrame attributes
print("DataFrame shape:", df.shape)
print("DataFrame columns:", df.columns)
print("DataFrame index:", df.index)
print("DataFrame data types:\n", df.dtypes)

DataFrame shape: (5, 3)
DataFrame columns: Index(['A', 'B', 'C'], dtype='object')
DataFrame index: RangeIndex(start=0, stop=5, step=1)
DataFrame data types:
 A     int64
B     int64
C    object
dtype: object

In [52]:
# Viewing data
print("Head of the DataFrame:\n", df.head())
print("Tail of the DataFrame:\n", df.tail())

Head of the DataFrame:
    A   B     C
0  1  10   foo
1  2  20   bar
2  3  30   baz
3  4  40   qux
4  5  50  quux
Tail of the DataFrame:
    A   B     C
0  1  10   foo
1  2  20   bar
2  3  30   baz
3  4  40   qux
4  5  50  quux

In [54]:
# Basic statistics (only numeric columns)
print("DataFrame description:\n", df.describe(include=[int, float]))
print("Sum of each column:\n", df.sum(numeric_only=True))
print("Mean of each column:\n", df.mean(numeric_only=True))
print("Max of each column:\n", df.max(numeric_only=True))

DataFrame description:
               A          B
count  5.000000   5.000000
mean   3.000000  30.000000
std    1.581139  15.811388
min    1.000000  10.000000
25%    2.000000  20.000000
50%    3.000000  30.000000
75%    4.000000  40.000000
max    5.000000  50.000000
Sum of each column:
 A     15
B    150
dtype: int64
Mean of each column:
 A     3.0
B    30.0
dtype: float64
Max of each column:
 A     5
B    50
dtype: int64

In [65]:
# Selecting data
# Selecting multiple columns 'A' and 'B'
df[['A', 'B']]

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [66]:
# Selecting rows 2 to 4 (inclusive)
df[2:4]

   A   B    C  A_squared
2  3  30  baz          9
3  4  40  qux         16

In [67]:
df.loc[2:4, ['A', 'B']]

   A   B
2  3  30
3  4  40
4  5  50

In [81]:
# Conditional selection
df[df['A'] > 2]

   A   B     C  A_squared   D
2  3  30   baz          9  33
3  4  40   qux         16  44
4  5  50  quux         25  55

In [82]:
# Adding new columns
df['D'] = df['A'] + df['B']
df

   A   B     C  A_squared   D
0  1  10   foo          1  11
1  2  20   bar          4  22
2  3  30   baz          9  33
3  4  40   qux         16  44
4  5  50  quux         25  55

In [80]:
# Dropping columns
df.drop('D', axis=1)

   A   B     C  A_squared
0  1  10   foo          1
1  2  20   bar          4
2  3  30   baz          9
3  4  40   qux         16
4  5  50  quux         25

In [76]:
# Sorting
df.sort_values(by='B', ascending=False)

   A   B     C  A_squared
4  5  50  quux         25
3  4  40   qux         16
2  3  30   baz          9
1  2  20   bar          4
0  1  10   foo          1

In [75]:
# Handling missing values
df_with_nan = df.copy()
df_with_nan.loc[1, 'A'] = None
df_with_nan.fillna(0)

     A   B     C  A_squared
0  1.0  10   foo          1
1  0.0  20   bar          4
2  3.0  30   baz          9
3  4.0  40   qux         16
4  5.0  50  quux         25

In [74]:
# Applying functions
df['A_squared'] = df['A'].apply(lambda x: x ** 2)
df

   A   B     C  A_squared
0  1  10   foo          1
1  2  20   bar          4
2  3  30   baz          9
3  4  40   qux         16
4  5  50  quux         25

## 4. Data Conversion, Computation, and Visualization

### 4.1 Converting Data Types

In [14]:
import pandas as pd

# Sample DataFrame
data = {'A': [1, 2, 3, 4], 'B': ['10', '20', '30', '40']}
df = pd.DataFrame(data)

# Converting column B from string to integer
df['B'] = df['B'].astype(int)
df.dtypes

A    int64
B    int32
dtype: object

### 4.2 Applying Functions
- Using `apply()`, `map()`, and `applymap()`

In [8]:
# Applying a function to a column using apply()
df['A_squared'] = df['A'].apply(lambda x: x ** 2)
df

   A   B  A_squared B_mapped
0  1  10          1        X
1  2  20          4        Y
2  3  30          9        Z
3  4  40         16        W

In [9]:
# Mapping values in a column using map()
df['B_mapped'] = df['B'].map({10: 'X', 20: 'Y', 30: 'Z', 40: 'W'})
df

   A   B  A_squared B_mapped
0  1  10          1        X
1  2  20          4        Y
2  3  30          9        Z
3  4  40         16        W

In [ ]:
# Applying a function to all elements of the DataFrame using applymap()
df_applied = df.applymap(lambda x: str(x) + '!')
df_applied

    A    B A_squared B_mapped
0  1!  10!        1!       X!
1  2!  20!        4!       Y!
2  3!  30!        9!       Z!
3  4!  40!       16!       W!

### 4.3 String Manipulation
- Using the `str` accessor for string operations
| **Method**         | **Description**                                                                                       | **Example Code**                              |
|--------------------|-------------------------------------------------------------------------------------------------------|-----------------------------------------------|
| `str.lower()`      | Converts strings in the Series/Index to lowercase.                                                     | `df['col'].str.lower()`                       |
| `str.upper()`      | Converts strings in the Series/Index to uppercase.                                                     | `df['col'].str.upper()`                       |
| `str.len()`        | Computes the length of each string in the Series/Index.                                                | `df['col'].str.len()`                         |
| `str.strip()`      | Removes leading and trailing whitespace.                                                              | `df['col'].str.strip()`                       |
| `str.lstrip()`     | Removes leading whitespace.                                                                           | `df['col'].str.lstrip()`                      |
| `str.rstrip()`     | Removes trailing whitespace.                                                                          | `df['col'].str.rstrip()`                      |
| `str.replace()`    | Replaces occurrences of a string with another string.                                                 | `df['col'].str.replace('old', 'new')`         |
| `str.contains()`   | Checks if each string in the Series/Index contains a pattern/regex.                                    | `df['col'].str.contains('pattern')`           |
| `str.startswith()` | Checks if each string in the Series/Index starts with a pattern.                                       | `df['col'].str.startswith('prefix')`          |
| `str.endswith()`   | Checks if each string in the Series/Index ends with a pattern.                                         | `df['col'].str.endswith('suffix')`            |
| `str.find()`       | Returns the lowest index of the substring. Returns -1 if not found.                                    | `df['col'].str.find('substring')`             |
| `str.findall()`    | Finds all occurrences of pattern/regex in the Series/Index.                                            | `df['col'].str.findall('pattern')`            |
| `str.match()`      | Determines if each string matches a regular expression.                                               | `df['col'].str.match('pattern')`              |
| `str.count()`      | Counts occurrences of pattern in each string.                                                         | `df['col'].str.count('pattern')`              |
| `str.split()`      | Splits each string by the specified delimiter and returns a list of strings.                          | `df['col'].str.split('delimiter')`            |
| `str.cat()`        | Concatenates strings in the Series/Index with the given separator.                                    | `df['col'].str.cat(sep='separator')`          |
| `str.get()`        | Extracts element from each component at specified position.                                           | `df['col'].str.get(0)`                        |
| `str.join()`       | Joins lists contained as elements in the Series/Index with the passed delimiter.                      | `df['col'].str.join('-')`                     |
| `str.extract()`    | Extracts groups from the first match of regular expression pattern.                                   | `df['col'].str.extract('pattern')`            |
| `str.extractall()` | Extracts all matches of regular expression pattern.                                                   | `df['col'].str.extractall('pattern')`         |
| `str.zfill()`      | Pads each string in the Series/Index with zeros on the left to reach a specified width.                | `df['col'].str.zfill(5)`                      |
| `str.pad()`        | Pads each string in the Series/Index with the specified character on the left and/or right sides.     | `df['col'].str.pad(width=10, side='left')`    |
| `str.slice()`      | Slices each string in the Series/Index by specified positions.                                        | `df['col'].str.slice(start=0, stop=3)`        |
| `str.wrap()`       | Wraps each string in the Series/Index at the specified width.                                         | `df['col'].str.wrap(width=10)`                |
| `str.get_dummies()`| Converts Series/Index to dummy variables (one-hot encoding).                                          | `df['col'].str.get_dummies(sep=' ')`          |

In [15]:
# Sample DataFrame with string data
data = {'C': ['apple', 'banana', 'cherry', 'date']}
df_str = pd.DataFrame(data)
df_str

        C
0   apple
1  banana
2  cherry
3    date

In [11]:
# Converting to uppercase
df_str['C_upper'] = df_str['C'].str.upper()
df_str

        C C_upper
0   apple   APPLE
1  banana  BANANA
2  cherry  CHERRY
3    date    DATE

In [12]:
# Checking if the string contains a substring
df_str['C_has_a'] = df_str['C'].str.contains('a')
df_str

        C C_upper  C_has_a
0   apple   APPLE     True
1  banana  BANANA     True
2  cherry  CHERRY    False
3    date    DATE     True

### 4.4 Melting and Spreading Data

In [84]:
# Sample DataFrame
data = {
    'id': [1, 2, 3],
    'name': ['Alice', 'Bob', 'Charlie'],
    'math_score': [85, 90, 95],
    'english_score': [80, 85, 88]
}
df = pd.DataFrame(data)
print("Original DataFrame:\n", df)

# Melting (wide to long format)
df_melted = pd.melt(df, id_vars=['id', 'name'], var_name='subject', value_name='score')
print("\nMelted DataFrame (wide to long):\n", df_melted)

# Spreading (long to wide format) using pivot
df_spread = df_melted.pivot(index=['id', 'name'], columns='subject', values='score').reset_index()
print("\nSpread DataFrame (long to wide) using pivot:\n", df_spread)

# Alternative spreading using unstack
df_spread_unstack = df_melted.set_index(['id', 'name', 'subject']).unstack().reset_index()
df_spread_unstack.columns = ['id', 'name'] + [col[1] for col in df_spread_unstack.columns[2:]]
print("\nSpread DataFrame (long to wide) using unstack:\n", df_spread_unstack)

Original DataFrame:
    id     name  math_score  english_score
0   1    Alice          85             80
1   2      Bob          90             85
2   3  Charlie          95             88

Melted DataFrame (wide to long):
    id     name        subject  score
0   1    Alice     math_score     85
1   2      Bob     math_score     90
2   3  Charlie     math_score     95
3   1    Alice  english_score     80
4   2      Bob  english_score     85
5   3  Charlie  english_score     88

Spread DataFrame (long to wide) using pivot:
 subject  id     name  english_score  math_score
0         1    Alice             80          85
1         2      Bob             85          90
2         3  Charlie             88          95

Spread DataFrame (long to wide) using unstack:
    id     name  english_score  math_score
0   1    Alice             80          85
1   2      Bob             85          90
2   3  Charlie             88          95

### 4.5 Using Pivot and Pivot Table

In [85]:
# Sample DataFrame
data = {
    'date': ['2024-01-01', '2024-01-01', '2024-02-01', '2024-02-01'],
    'category': ['A', 'B', 'A', 'B'],
    'value': [10, 20, 30, 40]
}
df = pd.DataFrame(data)
print("Original DataFrame:\n", df)

# Pivot
df_pivot = df.pivot(index='date', columns='category', values='value').reset_index()
print("\nPivot DataFrame:\n", df_pivot)

# Pivot Table with aggregation
df_pivot_table = df.pivot_table(index='date', columns='category', values='value', aggfunc='sum').reset_index()
print("\nPivot Table DataFrame with sum aggregation:\n", df_pivot_table)

# Pivot Table with multiple aggregations
df_pivot_table_multi = df.pivot_table(index='date', columns='category', values='value', aggfunc=['sum', 'mean']).reset_index()
print("\nPivot Table DataFrame with multiple aggregations:\n", df_pivot_table_multi)

Original DataFrame:
          date category  value
0  2024-01-01        A     10
1  2024-01-01        B     20
2  2024-02-01        A     30
3  2024-02-01        B     40

Pivot DataFrame:
 category        date   A   B
0         2024-01-01  10  20
1         2024-02-01  30  40

Pivot Table DataFrame with sum aggregation:
 category        date   A   B
0         2024-01-01  10  20
1         2024-02-01  30  40

Pivot Table DataFrame with multiple aggregations:
                 date sum     mean
category               A   B    A   B
0         2024-01-01  10  20   10  20
1         2024-02-01  30  40   30  40